ss1969/EdgeTx-AT32F435EVB/project/src/aps6404l.c
#include "aps6404l.h"
#include "at32f435_437_edma.h"
#include "at32f435_437_qspi.h"

#define APS6404L_HW_TIMEOUT 2000000U

static uint8_t aps6404l_edma_inited = 0;

/**
  * @brief  Wait for command completion flag without clearing it.
  * @param  qspi_x: QSPI peripheral instance.
  * @param  timeout: loop counter timeout.
  * @retval 1 on success, 0 on timeout.
  */
static int qspi_wait_cmd_flag(qspi_type *qspi_x, uint32_t timeout)
{
  while(qspi_flag_get(qspi_x, QSPI_CMDSTS_FLAG) == RESET)
  {
    if(timeout-- == 0)
    {
      return 0;
    }
  }
  return 1;
}

/**
  * @brief  Wait for command completion flag and clear it.
  * @param  qspi_x: QSPI peripheral instance.
  * @param  timeout: loop counter timeout.
  * @retval 1 on success, 0 on timeout.
  */
static int qspi_wait_cmd_done(qspi_type *qspi_x, uint32_t timeout)
{
  while(qspi_flag_get(qspi_x, QSPI_CMDSTS_FLAG) == RESET)
  {
    if(timeout-- == 0)
    {
      return 0;
    }
  }
  qspi_flag_clear(qspi_x, QSPI_CMDSTS_FLAG);
  return 1;
}

/**
  * @brief  Wait for TX FIFO ready flag.
  * @param  qspi_x: QSPI peripheral instance.
  * @param  timeout: loop counter timeout.
  * @retval 1 on success, 0 on timeout.
  */
static int qspi_wait_txfifo_ready(qspi_type *qspi_x, uint32_t timeout)
{
  while(qspi_flag_get(qspi_x, QSPI_TXFIFORDY_FLAG) == RESET)
  {
    if(timeout-- == 0)
    {
      return 0;
    }
  }
  return 1;
}

/**
  * @brief  Switch QSPI1 between command-port mode and XIP (memory-mapped) mode.
  * @note   This function adds timeouts to avoid hard lockups during mode switching.
  * @param  new_state: TRUE enables XIP, FALSE enables command-port mode.
  * @param  timeout: loop counter timeout.
  * @retval 1 on success, 0 on timeout.
  */
static int aps_qspi_xip_enable(confirm_state new_state, uint32_t timeout)
{
  uint32_t dly;

  if(new_state == (confirm_state)(QSPI1->ctrl_bit.xipsel))
  {
    return 1;
  }

  while(QSPI1->fifosts_bit.txfifordy == 0)
  {
    if(timeout-- == 0)
    {
      return 0;
    }
  }

  dly = 64;
  while(dly--)
  {
    __NOP();
  }

  QSPI1->ctrl_bit.xiprcmdf = 1;

  while(QSPI1->ctrl_bit.abort)
  {
    if(timeout-- == 0)
    {
      return 0;
    }
  }

  dly = 64;
  while(dly--)
  {
    __NOP();
  }

  QSPI1->ctrl_bit.xipsel = new_state;

  while(QSPI1->ctrl_bit.abort)
  {
    if(timeout-- == 0)
    {
      return 0;
    }
  }

  if(new_state == TRUE)
  {
    while(QSPI1->xip_cmd_w3_bit.csts)
    {
      if(timeout-- == 0)
      {
        return 0;
      }
    }
  }

  return 1;
}

static void aps_edma_clear_stream1_flags(void)
{
  edma_flag_clear(EDMA_FERR1_FLAG);
  edma_flag_clear(EDMA_DMERR1_FLAG);
  edma_flag_clear(EDMA_DTERR1_FLAG);
  edma_flag_clear(EDMA_HDT1_FLAG);
  edma_flag_clear(EDMA_FDT1_FLAG);
}

static void aps_edma_clear_stream2_flags(void)
{
  edma_flag_clear(EDMA_FERR2_FLAG);
  edma_flag_clear(EDMA_DMERR2_FLAG);
  edma_flag_clear(EDMA_DTERR2_FLAG);
  edma_flag_clear(EDMA_HDT2_FLAG);
  edma_flag_clear(EDMA_FDT2_FLAG);
}

static void aps_edma_init_once(void)
{
  edma_init_type edma_init_struct;

  if(aps6404l_edma_inited)
  {
    return;
  }

  edmamux_enable(TRUE);
  edmamux_init(EDMAMUX_CHANNEL1, EDMAMUX_DMAREQ_ID_QSPI1);
  edmamux_init(EDMAMUX_CHANNEL2, EDMAMUX_DMAREQ_ID_QSPI1);

  edma_reset(EDMA_STREAM1);
  edma_reset(EDMA_STREAM2);

  edma_default_para_init(&edma_init_struct);
  edma_init_struct.peripheral_data_width = EDMA_PERIPHERAL_DATA_WIDTH_WORD;
  edma_init_struct.peripheral_inc_enable = FALSE;
  edma_init_struct.memory_data_width = EDMA_MEMORY_DATA_WIDTH_WORD;
  edma_init_struct.memory_inc_enable = TRUE;
  edma_init_struct.fifo_mode_enable = TRUE;
  edma_init_struct.fifo_threshold = EDMA_FIFO_THRESHOLD_HALF;
  edma_init_struct.peripheral_burst_mode = EDMA_PERIPHERAL_SINGLE;
  edma_init_struct.memory_burst_mode = EDMA_MEMORY_SINGLE;
  edma_init_struct.priority = EDMA_PRIORITY_HIGH;
  edma_init_struct.loop_mode_enable = FALSE;
  edma_init_struct.buffer_size = 0;
  edma_init_struct.peripheral_base_addr = (uint32_t)&QSPI1->dt;

  edma_init_struct.direction = EDMA_DIR_MEMORY_TO_PERIPHERAL;
  edma_init(EDMA_STREAM1, &edma_init_struct);

  edma_init_struct.direction = EDMA_DIR_PERIPHERAL_TO_MEMORY;
  edma_init(EDMA_STREAM2, &edma_init_struct);

  edma_stream_enable(EDMA_STREAM1, FALSE);
  edma_stream_enable(EDMA_STREAM2, FALSE);
  aps_edma_clear_stream1_flags();
  aps_edma_clear_stream2_flags();

  aps6404l_edma_inited = 1;
}

static int aps_edma_wait_fdt(uint32_t fdt_flag, uint32_t ferr_flag, uint32_t dmerr_flag, uint32_t dterr_flag, uint32_t timeout)
{
  while(edma_flag_get(fdt_flag) == RESET)
  {
    if(edma_flag_get(ferr_flag) != RESET)
    {
      return 0;
    }
    if(edma_flag_get(dmerr_flag) != RESET)
    {
      return 0;
    }
    if(edma_flag_get(dterr_flag) != RESET)
    {
      return 0;
    }
    if(timeout-- == 0)
    {
      return 0;
    }
  }
  return 1;
}

/**
  * @brief  Reset APS6404L via command-port (0x66, 0x99).
  * @note   Requires QSPI1 to be configured and wired to APS6404L.
  * @retval none.
  */
void PSRAM_Reset(void)
{
  qspi_cmd_type cmd;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = 0;
  cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  cmd.data_counter = 0;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_111;
  cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  cmd.read_status_enable = TRUE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  cmd.instruction_code = APS6404L_RESET_ENABLE;
  qspi_cmd_operation_kick(QSPI1, &cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return;
  }

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  cmd.instruction_code = APS6404L_RESET;
  qspi_cmd_operation_kick(QSPI1, &cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
}

/**
  * @brief  Read APS6404L JEDEC ID via command-port (0x9F).
  * @note   Device returns 3 dummy bytes before actual ID bytes.
  * @param  pBuffer: output buffer for ID bytes.
  * @param  nLength: number of ID bytes to read.
  * @retval 1 on success, 0 on failure.
  */
int PSRAM_ReadID(unsigned char *pBuffer, int nLength)
{
  int i;
  qspi_cmd_type cmd;
  uint8_t value;
  volatile uint32_t delay;
  uint32_t total_len;
  uint32_t wait;

  if(nLength <= 0)
  {
    return 0;
  }

  total_len = (uint32_t)nLength + 3U;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

