ss1969/EdgeTx-AT32F435EVB/project/src/aps6404l.c
  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_READ_ID;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = 0;
  cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  cmd.data_counter = total_len;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_111;
  cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  cmd.read_status_enable = TRUE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  if(!qspi_wait_cmd_flag(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  for(i = 0; i < (int)total_len; i++)
  {
    wait = 256;
    while(qspi_flag_get(QSPI1, QSPI_RXFIFORDY_FLAG) == RESET)
    {
      if(wait-- == 0)
      {
        break;
      }
    }
    delay = 16;
    while(delay--)
    {
      __NOP();
    }
    value = qspi_byte_read(QSPI1);
    if((unsigned int)i >= 3U)
    {
      unsigned int out_index = (unsigned int)i - 3U;
      if(out_index < (unsigned int)nLength)
      {
        pBuffer[out_index] = (unsigned char)value;
      }
    }
  }

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
  return 1;
}

/**
  * @brief  Write bytes to APS6404L via command-port (0x02 + 24-bit address).
  * @note   For best performance and robustness, prefer memory-mapped access at APS6404L_MEM_BASE.
  * @param  address: 24-bit address.
  * @param  pBuffer: source buffer.
  * @param  nLength: number of bytes to write.
  * @retval 1 on success, 0 on failure.
  */
int PSRAM_QPI_Write(unsigned int address, const unsigned char *pBuffer, int nLength)
{
  int i;
  qspi_cmd_type cmd;

  if(nLength <= 0)
  {
    return 0;
  }

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_WRITE;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = address;
  cmd.address_length = QSPI_CMD_ADRLEN_3_BYTE;
  cmd.data_counter = (uint32_t)nLength;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_111;
  cmd.read_status_config = QSPI_RSTSC_HW_AUTO;
  cmd.read_status_enable = FALSE;
  cmd.write_data_enable = TRUE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  for(i = 0; i < nLength; i++)
  {
    if(!qspi_wait_txfifo_ready(QSPI1, APS6404L_HW_TIMEOUT))
    {
      aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
      return 0;
    }
    qspi_byte_write(QSPI1, (uint8_t)pBuffer[i]);
  }

  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
  return 1;
}

/**
  * @brief  Read bytes from APS6404L via command-port (0x03 + 24-bit address).
  * @note   For best performance and robustness, prefer memory-mapped access at APS6404L_MEM_BASE.
  * @param  address: 24-bit address.
  * @param  pBuffer: destination buffer.
  * @param  nLength: number of bytes to read.
  * @retval 1 on success, 0 on failure.
  */
int PSRAM_QPI_Read(unsigned int address, unsigned char *pBuffer, int nLength)
{
  int i;
  qspi_cmd_type cmd;
  unsigned int timeout;

  if(nLength <= 0)
  {
    return 0;
  }

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_READ;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = address;
  cmd.address_length = QSPI_CMD_ADRLEN_3_BYTE;
  cmd.data_counter = (uint32_t)nLength;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_111;
  cmd.read_status_config = QSPI_RSTSC_HW_AUTO;
  cmd.read_status_enable = FALSE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  for(i = 0; i < nLength; i++)
  {
    timeout = 200000U;
    while(qspi_flag_get(QSPI1, QSPI_RXFIFORDY_FLAG) == RESET)
    {
      if(timeout-- == 0U)
      {
        aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
        return 0;
      }
    }
    pBuffer[i] = (unsigned char)qspi_byte_read(QSPI1);
  }

  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  if(!aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  return 1;
}

int PSRAM_QPI_FastRead(unsigned int address, unsigned char *pBuffer, int nLength)
{
  int i;
  qspi_cmd_type cmd;
  unsigned int timeout;

  if(nLength <= 0)
  {
    return 0;
  }

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_QUAD_READ;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = address;
  cmd.address_length = QSPI_CMD_ADRLEN_3_BYTE;
  cmd.data_counter = (uint32_t)nLength;
  cmd.second_dummy_cycle_num = APS6404L_FAST_READ_DUMMY_CYCLES;
  cmd.operation_mode = QSPI_OPERATE_MODE_444;
  cmd.read_status_config = QSPI_RSTSC_HW_AUTO;
  cmd.read_status_enable = FALSE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  for(i = 0; i < nLength; i++)
  {
    timeout = 200000U;
    while(qspi_flag_get(QSPI1, QSPI_RXFIFORDY_FLAG) == RESET)
    {
      if(timeout-- == 0U)
      {
        aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
        return 0;
      }
    }
    pBuffer[i] = (unsigned char)qspi_byte_read(QSPI1);
  }

  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  if(!aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  return 1;
}

int PSRAM_QPI_FastWrite(unsigned int address, const unsigned char *pBuffer, int nLength)
{
  int i;
  qspi_cmd_type cmd;

  if(nLength <= 0)
  {
    return 0;
  }

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

