ss1969/EdgeTx-AT32F435EVB/project/src/aps6404l.c
  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_QUAD_WRITE;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = address;
  cmd.address_length = QSPI_CMD_ADRLEN_3_BYTE;
  cmd.data_counter = (uint32_t)nLength;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_444;
  cmd.read_status_config = QSPI_RSTSC_HW_AUTO;
  cmd.read_status_enable = FALSE;
  cmd.write_data_enable = TRUE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  for(i = 0; i < nLength; i++)
  {
    if(!qspi_wait_txfifo_ready(QSPI1, APS6404L_HW_TIMEOUT))
    {
      aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
      return 0;
    }
    qspi_byte_write(QSPI1, (uint8_t)pBuffer[i]);
  }

  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
  return 1;
}

int PSRAM_EDMA_Write(unsigned int address, const unsigned char *pBuffer, int nLength)
{
  qspi_cmd_type qpi_cmd;
  qspi_cmd_type cmd;
  qspi_cmd_type exit_cmd;
  qspi_cmd_type exit_cmd2;
  uint32_t word_count;
  uint32_t word_bytes;
  uint32_t remain_bytes;

  if(nLength <= 0)
  {
    return 0;
  }

  if(((uint32_t)pBuffer & 3U) != 0U)
  {
    return PSRAM_QPI_Write(address, pBuffer, nLength);
  }

  if((uint32_t)nLength < 32U)
  {
    return PSRAM_QPI_Write(address, pBuffer, nLength);
  }

  word_count = (uint32_t)nLength >> 2;
  if(word_count < 8U)
  {
    return PSRAM_QPI_Write(address, pBuffer, nLength);
  }

  if(word_count > 0xFFFFU)
  {
    word_count = 0xFFFFU;
  }

  word_bytes = word_count << 2;
  remain_bytes = (uint32_t)nLength - word_bytes;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  aps_edma_init_once();

  qspi_dma_enable(QSPI1, FALSE);

  qpi_cmd.pe_mode_enable = FALSE;
  qpi_cmd.pe_mode_operate_code = 0;
  qpi_cmd.instruction_code = APS6404L_ENTER_QUAD_MODE;
  qpi_cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  qpi_cmd.address_code = 0;
  qpi_cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  qpi_cmd.data_counter = 0;
  qpi_cmd.second_dummy_cycle_num = 0;
  qpi_cmd.operation_mode = QSPI_OPERATE_MODE_111;
  qpi_cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  qpi_cmd.read_status_enable = TRUE;
  qpi_cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &qpi_cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_QUAD_WRITE;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = address;
  cmd.address_length = QSPI_CMD_ADRLEN_3_BYTE;
  cmd.data_counter = word_bytes;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_444;
  cmd.read_status_config = QSPI_RSTSC_HW_AUTO;
  cmd.read_status_enable = FALSE;
  cmd.write_data_enable = TRUE;

  edma_stream_enable(EDMA_STREAM1, FALSE);
  aps_edma_clear_stream1_flags();
  EDMA_STREAM1->dtcnt = (uint16_t)word_count;
  EDMA_STREAM1->paddr = (uint32_t)&QSPI1->dt;
  EDMA_STREAM1->m0addr = (uint32_t)pBuffer;

  qspi_dma_enable(QSPI1, TRUE);
  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  edma_stream_enable(EDMA_STREAM1, TRUE);
  if(!aps_edma_wait_fdt(EDMA_FDT1_FLAG, EDMA_FERR1_FLAG, EDMA_DMERR1_FLAG, EDMA_DTERR1_FLAG, APS6404L_HW_TIMEOUT))
  {
    edma_stream_enable(EDMA_STREAM1, FALSE);
    qspi_dma_enable(QSPI1, FALSE);
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  edma_stream_enable(EDMA_STREAM1, FALSE);
  aps_edma_clear_stream1_flags();

  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    qspi_dma_enable(QSPI1, FALSE);
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  qspi_dma_enable(QSPI1, FALSE);

  exit_cmd.pe_mode_enable = FALSE;
  exit_cmd.pe_mode_operate_code = 0;
  exit_cmd.instruction_code = APS6404L_EXIT_QUAD_MODE;
  exit_cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  exit_cmd.address_code = 0;
  exit_cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  exit_cmd.data_counter = 0;
  exit_cmd.second_dummy_cycle_num = 0;
  exit_cmd.operation_mode = QSPI_OPERATE_MODE_444;
  exit_cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  exit_cmd.read_status_enable = TRUE;
  exit_cmd.write_data_enable = FALSE;

  exit_cmd2 = exit_cmd;
  exit_cmd2.operation_mode = QSPI_OPERATE_MODE_111;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &exit_cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &exit_cmd2);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);

  if(remain_bytes != 0U)
  {
    return PSRAM_QPI_Write(address + word_bytes, pBuffer + word_bytes, (int)remain_bytes);
  }

  return 1;
}

int PSRAM_EDMA_Read(unsigned int address, unsigned char *pBuffer, int nLength)
{
  qspi_cmd_type qpi_cmd;
  qspi_cmd_type cmd;
  qspi_cmd_type exit_cmd;
  qspi_cmd_type exit_cmd2;
  uint32_t word_count;
  uint32_t word_bytes;
  uint32_t remain_bytes;

  if(nLength <= 0)
  {
    return 0;
  }

  if(((uint32_t)pBuffer & 3U) != 0U)
  {
    return PSRAM_QPI_Read(address, pBuffer, nLength);
  }

  if((uint32_t)nLength < 32U)
  {
    return PSRAM_QPI_Read(address, pBuffer, nLength);
  }

  word_count = (uint32_t)nLength >> 2;
  if(word_count < 8U)
  {
    return PSRAM_QPI_Read(address, pBuffer, nLength);
  }

  if(word_count > 0xFFFFU)
  {
    word_count = 0xFFFFU;
  }

  word_bytes = word_count << 2;
  remain_bytes = (uint32_t)nLength - word_bytes;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  aps_edma_init_once();

  qspi_dma_enable(QSPI1, FALSE);

  qpi_cmd.pe_mode_enable = FALSE;
  qpi_cmd.pe_mode_operate_code = 0;
  qpi_cmd.instruction_code = APS6404L_ENTER_QUAD_MODE;
  qpi_cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  qpi_cmd.address_code = 0;
  qpi_cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  qpi_cmd.data_counter = 0;
  qpi_cmd.second_dummy_cycle_num = 0;
  qpi_cmd.operation_mode = QSPI_OPERATE_MODE_111;
  qpi_cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  qpi_cmd.read_status_enable = TRUE;
  qpi_cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &qpi_cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

