ss1969/EdgeTx-AT32F435EVB/project/src/aps6404l.c
  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_QUAD_READ;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = address;
  cmd.address_length = QSPI_CMD_ADRLEN_3_BYTE;
  cmd.data_counter = word_bytes;
  cmd.second_dummy_cycle_num = APS6404L_FAST_READ_DUMMY_CYCLES;
  cmd.operation_mode = QSPI_OPERATE_MODE_444;
  cmd.read_status_config = QSPI_RSTSC_HW_AUTO;
  cmd.read_status_enable = FALSE;
  cmd.write_data_enable = FALSE;

  edma_stream_enable(EDMA_STREAM2, FALSE);
  aps_edma_clear_stream2_flags();
  EDMA_STREAM2->dtcnt = (uint16_t)word_count;
  EDMA_STREAM2->paddr = (uint32_t)&QSPI1->dt;
  EDMA_STREAM2->m0addr = (uint32_t)pBuffer;

  qspi_dma_enable(QSPI1, TRUE);
  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);

  edma_stream_enable(EDMA_STREAM2, TRUE);
  if(!aps_edma_wait_fdt(EDMA_FDT2_FLAG, EDMA_FERR2_FLAG, EDMA_DMERR2_FLAG, EDMA_DTERR2_FLAG, APS6404L_HW_TIMEOUT))
  {
    edma_stream_enable(EDMA_STREAM2, FALSE);
    qspi_dma_enable(QSPI1, FALSE);
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  edma_stream_enable(EDMA_STREAM2, FALSE);
  aps_edma_clear_stream2_flags();

  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    qspi_dma_enable(QSPI1, FALSE);
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  qspi_dma_enable(QSPI1, FALSE);

  exit_cmd.pe_mode_enable = FALSE;
  exit_cmd.pe_mode_operate_code = 0;
  exit_cmd.instruction_code = APS6404L_EXIT_QUAD_MODE;
  exit_cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  exit_cmd.address_code = 0;
  exit_cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  exit_cmd.data_counter = 0;
  exit_cmd.second_dummy_cycle_num = 0;
  exit_cmd.operation_mode = QSPI_OPERATE_MODE_444;
  exit_cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  exit_cmd.read_status_enable = TRUE;
  exit_cmd.write_data_enable = FALSE;

  exit_cmd2 = exit_cmd;
  exit_cmd2.operation_mode = QSPI_OPERATE_MODE_111;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &exit_cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &exit_cmd2);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);

  if(remain_bytes != 0U)
  {
    return PSRAM_QPI_Read(address + word_bytes, pBuffer + word_bytes, (int)remain_bytes);
  }

  return 1;
}

/**
  * @brief  Enter QPI/quad mode (0x35).
  * @retval 1 on success, 0 on failure.
  */
int PSRAM_EnterQuadMode(void)
{
  qspi_cmd_type cmd;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_ENTER_QUAD_MODE;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = 0;
  cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  cmd.data_counter = 0;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_111;
  cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  cmd.read_status_enable = TRUE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
  return 1;
}

/**
  * @brief  Exit QPI/quad mode (0xF5).
  * @retval 1 on success, 0 on failure.
  */
int PSRAM_ExitQuadMode(void)
{
  qspi_cmd_type cmd;
  qspi_cmd_type cmd2;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_EXIT_QUAD_MODE;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = 0;
  cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  cmd.data_counter = 0;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_444;
  cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  cmd.read_status_enable = TRUE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  cmd2 = cmd;
  cmd2.operation_mode = QSPI_OPERATE_MODE_111;
  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd2);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
  return 1;
}

/**
  * @brief  Toggle wrap boundary mode (0xC0).
  * @retval 1 on success, 0 on failure.
  */
int PSRAM_ToggleWrapBoundary(void)
{
  qspi_cmd_type cmd;

  if(!aps_qspi_xip_enable(FALSE, APS6404L_HW_TIMEOUT))
  {
    return 0;
  }

  cmd.pe_mode_enable = FALSE;
  cmd.pe_mode_operate_code = 0;
  cmd.instruction_code = APS6404L_WRAP_BOUNDARY_TOGGLE;
  cmd.instruction_length = QSPI_CMD_INSLEN_1_BYTE;
  cmd.address_code = 0;
  cmd.address_length = QSPI_CMD_ADRLEN_0_BYTE;
  cmd.data_counter = 0;
  cmd.second_dummy_cycle_num = 0;
  cmd.operation_mode = QSPI_OPERATE_MODE_111;
  cmd.read_status_config = QSPI_RSTSC_SW_ONCE;
  cmd.read_status_enable = TRUE;
  cmd.write_data_enable = FALSE;

  qspi_flag_clear(QSPI1, QSPI_CMDSTS_FLAG);
  qspi_cmd_operation_kick(QSPI1, &cmd);
  if(!qspi_wait_cmd_done(QSPI1, APS6404L_HW_TIMEOUT))
  {
    aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
    return 0;
  }

  aps_qspi_xip_enable(TRUE, APS6404L_HW_TIMEOUT);
  return 1;
}
